Revit 2024 API
ParameterTypeId.ImportAdtEntityStyle Property
 "Style Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ImportAdtEntityStyle { get; }
Visual Basic
Public Shared ReadOnly Property ImportAdtEntityStyle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ImportAdtEntityStyle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace